[BITS 16]               ; 16 bit 리얼 모드
[ORG 0x7C00]            ; 0x7C00부터 부트 섹터 시작

;--------------------------------------------------------------------------------
; start 레이블
;--------------------------------------------------------------------------------
start:
    ; 세그먼트 레지스터 초기화
    cli			            ; 초기화 중 안전을 위한 인터럽트 비활성화
    xor ax, ax		        ; ax = 0x00
    mov ds, ax		        ; ds = 0x00
    mov es, ax		        ; es = 0x00
    mov ss, ax		        ; ss = 0x00
    mov sp, 0x7C00	        ; 스택 포인터를 부트 섹터 시작점으로 설정
    sti			            ; 인터럽트 활성화

    mov si, MSG_HELLO       ; 문자열 시작 주소 저장
    call print_loop         ; 문자열 출력

    call load_kernel        ; 커널 로드

;--------------------------------------------------------------------------------
; 외부 코드 포함
;--------------------------------------------------------------------------------
%include "boot/print_string.asm"
%include "boot/load_kernel.asm"

;--------------------------------------------------------------------------------
; 데이터
;--------------------------------------------------------------------------------
MSG_HELLO db 'Hello, PixelOS Booted from HDD!', 0x0A, 0

;--------------------------------------------------------------------------------
; 부트섹터 패딩 및 시그니처
;--------------------------------------------------------------------------------
times 510-($-$$) db 0   ; 부트섹터 크기를 512 byte로 맞춤 설정
dw 0xAA55               ; BIOS 부트 시그니처 : 마지막 2 byte